
Функция СведенияОВнешнейОбработке() Экспорт

	лВидОбработки	= "ДополнительнаяОбработка";// "ДополнительныйОтчет"
	лОбработкаИспользование = "ОткрытиеФормы";	// "ВызовСерверногоМетода"

	лНазначение		= Неопределено;
	лБезопасныйРежим= Ложь;
	лВерсияБСП		= "3.0.1.252";

	лОбработкаИдентификатор	= Метаданные().Имя;
	лОбработкаНаименование	= НСтр("ru = '" +Метаданные().Представление()+ "'");
	лОбработкаОписание		= НСтр("ru = '" +Метаданные().Комментарий+ "'");


	лТаблицаКоманд	= ПолучитьТаблицуКоманд();
	ДобавитьКоманду(лТаблицаКоманд,
					лОбработкаНаименование,
					лОбработкаИдентификатор,
					лОбработкаИспользование);

	лПараметрыРегистрации = Новый Структура;
	лПараметрыРегистрации.Вставить("Вид"			, лВидОбработки);
	лПараметрыРегистрации.Вставить("Назначение"		, лНазначение);
	лПараметрыРегистрации.Вставить("БезопасныйРежим", лБезопасныйРежим);
	лПараметрыРегистрации.Вставить("ВерсияБСП"		, лВерсияБСП);
	лПараметрыРегистрации.Вставить("Наименование"	, лОбработкаНаименование);
	лПараметрыРегистрации.Вставить("Информация"		, лОбработкаОписание);
	лПараметрыРегистрации.Вставить("Версия"			, "1.0");
	лПараметрыРегистрации.Вставить("Команды"		, лТаблицаКоманд);

	Возврат лПараметрыРегистрации;
КонецФункции

Функция ПолучитьТаблицуКоманд()

	лТипСтрока = Новый ОписаниеТипов("Строка");
	лТипБулево = Новый ОписаниеТипов("Булево");

	лКоманды = Новый ТаблицаЗначений;

	лКоманды.Колонки.Добавить("Представление"		, лТипСтрока);
	лКоманды.Колонки.Добавить("Идентификатор"		, лТипСтрока);
	лКоманды.Колонки.Добавить("Использование"		, лТипСтрока);
	лКоманды.Колонки.Добавить("ПоказыватьОповещение", лТипБулево);
	лКоманды.Колонки.Добавить("Модификатор"			, лТипСтрока);

	Возврат лКоманды;
КонецФункции  

Процедура ДобавитьКоманду(пТаблицаКоманд, пПредставление, пИдентификатор, пИспользование, пПоказыватьОповещение = Ложь, пМодификатор = "")

	лНоваяКоманда = пТаблицаКоманд.Добавить();
	лНоваяКоманда.Представление			= пПредставление;
	лНоваяКоманда.Идентификатор			= пИдентификатор;
	лНоваяКоманда.Использование			= пИспользование;
	лНоваяКоманда.ПоказыватьОповещение	= пПоказыватьОповещение;
	лНоваяКоманда.Модификатор			= пМодификатор;

КонецПроцедуры

